lixpaulian/efr32xx-rail/platform/middleware/usb_gecko/src/em_usbdint.c
    // Select 48MHz for USBC clock.
#if defined( CMU_OSCENCMD_USHFRCOEN )
    CMU->CMD = CMU_CMD_USBCCLKSEL_USHFRCO;
    while ( ( CMU->STATUS & CMU_STATUS_USBCUSHFRCOSEL ) == 0 ){}
#else
    CMU->CMD = CMU_CMD_USBCCLKSEL_HFCLKNODIV;
    while ( ( CMU->STATUS & CMU_STATUS_USBCHFCLKSEL ) == 0 ){}
#endif

    // Exit partial powerdown mode.
    USB->PCGCCTL &= ~USB_PCGCCTL_STOPPCLK;
    USB->PCGCCTL &= ~(USB_PCGCCTL_PWRCLMP | USB_PCGCCTL_RSTPDWNMODULE);

    /* Restore USB core registers. */
    USB->GUSBCFG = x_USB_GUSBCFG;
    USB->DCFG    = x_USB_DCFG;

    // Turn on resume signalling.
    USB->DCTL = x_USB_DCTL | USB_DCTL_RMTWKUPSIG;

    USBTIMER_DelayMs(2);
    USB->GINTSTS = 0xFFFFFFFF;        // Clear all pending interrupt flags.

    RestoreEpCtrlRegisters();

    USB->DOEPMSK   = x_USB_DOEPMSK;
    USB->DIEPMSK   = x_USB_DIEPMSK;
    USB->DAINTMSK  = x_USB_DAINTMSK;
    USB->GNPTXFSIZ = x_USB_GNPTXFSIZ;
    USB->GRXFSIZ   = x_USB_GRXFSIZ;
    USB->GAHBCFG   = x_USB_GAHBCFG;
#if defined(_USB_GOTGCTL_MASK)
    USB->GOTGCTL   = x_USB_GOTGCTL;
#endif
    USB->GINTMSK   = x_USB_GINTMSK;

#if ( USB_PWRSAVE_MODE & USB_PWRSAVE_MODE_ENTEREM2 )
    // Make sure we won't reenter EM2 on an eventual interrupt exit.
    SCB->SCR &= ~(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk);
#endif

    CORE_ATOMIC_IRQ_ENABLE();
    USBTIMER_DelayMs( 10 );
    CORE_ATOMIC_IRQ_DISABLE();

    USBDHAL_ClearRemoteWakeup();
    // Setup EP0 for new commands.
    USBDHAL_StartEp0Setup( dev );
    USBDHAL_Ep0Activate( dev->ep0MpsCode );
  }
  else
  {
#endif // if (USB_PWRSAVE_MODE)
    USBDHAL_SetRemoteWakeup();

    CORE_ATOMIC_IRQ_ENABLE();
    USBTIMER_DelayMs( 10 );
    CORE_ATOMIC_IRQ_DISABLE();

    USBDHAL_ClearRemoteWakeup();
#if (USB_PWRSAVE_MODE)
  }
#endif
}

#if (USB_PWRSAVE_MODE)
static void RestoreEpCtrlRegisters(void)
{
#if ( NUM_EP_USED > 0 ) || ( FIFO_CNT > 0 )
  int i;
#endif
#if ( NUM_EP_USED > 0 )
  int epNum;
  uint32_t tmp;
  USBD_Ep_TypeDef *ep;
#endif

#if (FIFO_CNT > 0)
  for (i = 0; i < FIFO_CNT; i++)
  {
    USB_DIEPTXFS[i] = x_USB_DIEPTXFS[i];
  }
#endif

#if (NUM_EP_USED > 0)
  for (i = 0; i < NUM_EP_USED; i++)
  {
    ep = &dev->ep[i+1];
    epNum = ep->num;

    tmp = x_USB_EP_CTL[i]
          & ~(USB_DIEP_CTL_CNAK
              | USB_DIEP_CTL_SNAK
              | USB_DIEP_CTL_SETD0PIDEF
              | USB_DIEP_CTL_SETD1PIDOF);

    if (x_USB_EP_CTL[i] & USB_DIEP_CTL_DPIDEOF)
    {
      tmp |= USB_DIEP_CTL_SETD1PIDOF;
    }
    else
    {
      tmp |= USB_DIEP_CTL_SETD0PIDEF;
    }

    if (x_USB_EP_CTL[i] & USB_DIEP_CTL_NAKSTS)
    {
      tmp |= USB_DIEP_CTL_SNAK;
    }
    else
    {
      tmp |= USB_DIEP_CTL_CNAK;
    }

    if (ep->in)
    {
      USB_DINEPS[epNum].CTL     = tmp;
      USB_DINEPS[epNum].TSIZ    = x_USB_EP_TSIZ[i];
      USB_DINEPS[epNum].DMAADDR = x_USB_EP_DMAADDR[i];
    }
    else
    {
      USB_DOUTEPS[epNum].CTL     = tmp;
      USB_DOUTEPS[epNum].TSIZ    = x_USB_EP_TSIZ[i];
      USB_DOUTEPS[epNum].DMAADDR = x_USB_EP_DMAADDR[i];
    }
  }
#endif
}
#endif // if (USB_PWRSAVE_MODE)

#if defined( USB_DOEP0INT_STUPPKTRCVD )
static void HandleOutEpIntr( uint32_t status, USBD_Ep_TypeDef *ep )
{
  uint32_t doeptsiz;

  if ( ep->num == 0 )
  {
    if ( status & USB_DOEP0INT_XFERCOMPL )
    {
      USB->DOEP0INT = USB_DOEP0INT_XFERCOMPL;
      doeptsiz      = USB->DOEP0TSIZ;

      if ( ep->state == D_EP_IDLE )
      {
        if ( status & USB_DOEP0INT_STUPPKTRCVD )
        {
          USB->DOEP0INT = USB_DOEP0INT_STUPPKTRCVD;
        }
        status = USBDHAL_GetOutEpInts( ep );
        doeptsiz = USB->DOEP0TSIZ;

        if ( status & USB_DOEP0INT_SETUP )
        {
retry:
          /* Already started data stage, clear setup */
          USB->DOEP0INT = USB_DOEP0INT_SETUP;
          status       &= ~USB_DOEP0INT_SETUP;
          {
            int supCnt = ( doeptsiz & _USB_DOEP0TSIZ_SUPCNT_MASK )
                         >> _USB_DOEP0TSIZ_SUPCNT_SHIFT;

            if ( supCnt == 3 )
              supCnt = 2;

            dev->setup = &dev->setupPkt[ 2 - supCnt ];
          }
          DEBUG_USB_INT_LO_PUTS( "\nS" );
          USBDEP_Ep0Handler( dev );

          /* Prepare for more setup packets */
          if ( ep->state == D_EP0_IN_STATUS || ep->state == D_EP_TRANSMITTING )
          {
            USBDHAL_StartEp0Setup( dev );
          }
        }
        else /* xfercompl && idle && !setup */
        {
            status = USBDHAL_GetOutEpInts( ep );
            if ( status & USB_DOEP0INT_SETUP )
              goto retry;
            USBDHAL_StartEp0Setup( dev );
        }
      }
      else /* ep0state != EP0_IDLE */
      {
        if ( ep->state == D_EP_RECEIVING )
        {
          if ( ep->remaining > ep->packetSize )
          {
            ep->remaining -= ep->packetSize;
            ep->xferred += ep->packetSize;
          }
          else
          {
            ep->xferred += ep->remaining;
            ep->remaining = 0;
          }
          USBDEP_Ep0Handler( dev );
        }
        else if ( ep->state == D_EP0_OUT_STATUS )
        {
          USBDEP_Ep0Handler( dev );
        }
      }
    } /* if ( status & USB_DOEP0INT_XFERCOMPL ) */

    if ( status & USB_DOEP0INT_STSPHSERCVD )
    {
      USB->DOEP0INT = USB_DOEP0INT_STSPHSERCVD;
    }

    if ( status & USB_DOEP0INT_SETUP )
    {
      USB->DOEP0INT = USB_DOEP0INT_SETUP;
      {
        int supCnt = ( USB->DOEP0TSIZ & _USB_DOEP0TSIZ_SUPCNT_MASK )
                     >> _USB_DOEP0TSIZ_SUPCNT_SHIFT;

        if ( supCnt == 3 )
          supCnt = 2;

        dev->setup = &dev->setupPkt[ 2 - supCnt ];
      }
      DEBUG_USB_INT_LO_PUTS( "\nS" );
      USBDEP_Ep0Handler( dev );
    }
  }
  else /* epnum != 0 */
  {
    if ( status & USB_DOEP_INT_XFERCOMPL )
    {
      USB_DOUTEPS[ ep->num ].INT = USB_DOEP_INT_XFERCOMPL;

      ep->xferred = ep->hwXferSize -
          ( ( USB_DOUTEPS[ ep->num ].TSIZ & _USB_DOEP_TSIZ_XFERSIZE_MASK )>>
            _USB_DOEP_TSIZ_XFERSIZE_SHIFT );
      ep->remaining -= ep->xferred;

      USBDEP_EpHandler( ep->addr );
    }
  }
}
#endif

/** @endcond */

#endif /* defined( USB_DEVICE ) */
#endif /* defined( USB_PRESENT ) && ( USB_COUNT == 1 ) */
